In [1]:
import pandas as pd
import numpy as np

Group by:
 - slice
 - dice
 - summerize

In [2]:
# Group by
# SPLIT+ APLLY+ COMBINE

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656
4    a  one  0.542765 -0.656203

In [5]:
# compute mean of the data1 column using labels from key1
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped.mean()

key1
a   -0.440506
b    0.984188
Name: data1, dtype: float64

In [7]:
grouped.sum()

key1
a   -1.321517
b    1.968377
Name: data1, dtype: float64

In [8]:
grouped.count()

key1
a    3
b    2
Name: data1, dtype: int64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.353781
      two    -0.613955
b     one     1.708766
      two     0.259611
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.353781 -0.613955
b     1.708766  0.259611

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.613955
            2006    1.708766
Ohio        2005   -0.495358
            2006    0.542765
Name: data1, dtype: float64

In [14]:
df

  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656
4    a  one  0.542765 -0.656203

In [15]:
df.groupby(['key1']).size()

key1
a    3
b    2
dtype: int64

In [16]:
# Iterating over groups

In [17]:
df

  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656
4    a  one  0.542765 -0.656203

In [18]:
for name,group in df.groupby('key1'):
    print(name) #group name
    print(group) #data

a
  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
4    a  one  0.542765 -0.656203
b
  key1 key2     data1     data2
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656

In [19]:
# for multiple keys
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
4    a  one  0.542765 -0.656203
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.613955  0.000959
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.708766 -0.259209
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.259611  0.100656

In [20]:
# computing a dict of the data pieces
pieces = dict(list(df.groupby('key1')))

In [21]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one -1.250327 -0.938913
 1    a  two -0.613955  0.000959
 4    a  one  0.542765 -0.656203,
 'b':   key1 key2     data1     data2
 2    b  one  1.708766 -0.259209
 3    b  two  0.259611  0.100656}

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656

In [23]:
df

  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656
4    a  one  0.542765 -0.656203

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes,axis=1)

In [26]:
# Selecting a Column or Subset of Columns

In [27]:
df.groupby('key1')['data1'].mean() # returns series

key1
a   -0.440506
b    0.984188
Name: data1, dtype: float64

In [28]:
df.groupby('key1')[['data1']].mean() # returns df

         data1
key1
a    -0.440506
b     0.984188

In [29]:
# Grouping with Dicts and Series

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people

               a         b         c         d         e
Joe    -1.729549  0.865483  0.567403  0.592542  0.951460
Steve  -0.780049  0.010309  0.621050  0.511674 -0.898053
Wes    -0.271915 -2.035598 -0.235058  0.581963 -1.204786
Jim    -0.057893  0.013331 -1.039177 -0.228581 -0.708855
Travis -0.560118  1.223064 -0.985404  1.793224 -0.390111

In [32]:
people.iloc[2:3,[1,2]] = np.nan

In [33]:
people

               a         b         c         d         e
Joe    -1.729549  0.865483  0.567403  0.592542  0.951460
Steve  -0.780049  0.010309  0.621050  0.511674 -0.898053
Wes    -0.271915       NaN       NaN  0.581963 -1.204786
Jim    -0.057893  0.013331 -1.039177 -0.228581 -0.708855
Travis -0.560118  1.223064 -0.985404  1.793224 -0.390111

In [34]:
# suppose I have a group correspondence for the columns and want to sum together the 
# columns by the group
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [35]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [36]:
by_column = people.groupby(mapping,axis=1)

In [37]:
by_column.sum()

            blue       red
Joe     1.159945  0.087395
Steve   1.132724 -1.667793
Wes     0.581963 -1.476701
Jim    -1.267758 -0.753417
Travis  0.807819  0.272835

In [38]:
map_series = pd.Series(mapping)

In [39]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
# key - column names/index
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [41]:
# Grouping with function

In [42]:
people

               a         b         c         d         e
Joe    -1.729549  0.865483  0.567403  0.592542  0.951460
Steve  -0.780049  0.010309  0.621050  0.511674 -0.898053
Wes    -0.271915       NaN       NaN  0.581963 -1.204786
Jim    -0.057893  0.013331 -1.039177 -0.228581 -0.708855
Travis -0.560118  1.223064 -0.985404  1.793224 -0.390111

In [48]:
# grouping by length of names
people.groupby(len).count()

   a  b  c  d  e
3  3  2  2  3  3
5  1  1  1  1  1
6  1  1  1  1  1

In [49]:
# Grouping by index level

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
[1, 3, 5, 1, 3]],
names=['cty', 'tenor'])

In [51]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [52]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [53]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.053265  0.215526 -0.045725  1.860229  0.245549
1      0.987164 -0.450950  0.622323 -0.183730  0.522020
2     -0.417556  0.762957 -0.892169  1.495886 -0.339050
3     -0.498615 -1.339234 -1.364398 -0.831664 -1.684912

In [54]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [55]:
# DATA Aggregation

In [56]:
df

  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656
4    a  one  0.542765 -0.656203

In [57]:
grouped = df.groupby('key1')

In [58]:
for name,group in grouped:
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.250327 -0.938913
1    a  two -0.613955  0.000959
4    a  one  0.542765 -0.656203
b
  key1 key2     data1     data2
2    b  one  1.708766 -0.259209
3    b  two  0.259611  0.100656

In [59]:
grouped['data1'].quantile(0.9)

key1
a    0.311421
b    1.563850
Name: data1, dtype: float64

In [60]:
# you can define your own agg function
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [61]:
grouped.agg(peak_to_peak)

/tmp/ipykernel_70955/4193407341.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.793093  0.939872
b     1.449155  0.359865

In [62]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.440506  0.909043 -1.250327 -0.932141 -0.613955 -0.035595
b      2.0  0.984188  1.024707  0.259611  0.621900  0.984188  1.346477

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.542765   3.0 -0.531386  0.482208 -0.938913 -0.797558 -0.656203
b     1.708766   2.0 -0.079277  0.254463 -0.259209 -0.169243 -0.079277


           75%       max
key1
a    -0.327622  0.000959
b     0.010690  0.100656

In [63]:
# Column-Wise and Multiple Function Application
tips = pd.read_csv('Data/tips.csv')

In [64]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [65]:
tips.shape

(244, 6)

In [66]:
# adding tip pct of total bills
tips['tips_pct'] = tips['tip']/tips['total_bill']

In [67]:
tips.head()

   total_bill   tip smoker  day    time  size  tips_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [68]:
tips.groupby(['smoker'])['tips_pct'].mean()

smoker
No     0.159328
Yes    0.163196
Name: tips_pct, dtype: float64

In [69]:
grouped = tips.groupby(['day','smoker'])

In [72]:
grouped_pct = grouped['tips_pct']

In [73]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tips_pct, dtype: float64

In [74]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tips_pct, dtype: float64

In [75]:
# you cam pass a list of function too... it will return a DF
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [76]:
functions = ['count','mean','max']
result = grouped['tips_pct','total_bill'].agg(functions)

/tmp/ipykernel_70955/1317519693.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tips_pct','total_bill'].agg(functions)

In [77]:
result

            tips_pct                     total_bill
               count      mean       max      count       mean    max
day  smoker
Fri  No            4  0.151650  0.187735          4  18.420000  22.75
     Yes          15  0.174783  0.263480         15  16.813333  40.17
Sat  No           45  0.158048  0.291990         45  19.661778  48.33
     Yes          42  0.147906  0.325733         42  21.276667  50.81
Sun  No           57  0.160113  0.252672         57  20.506667  48.17
     Yes          19  0.187250  0.710345         19  24.120000  45.35
Thur No           45  0.160298  0.266312         45  17.113111  41.19
     Yes          17  0.163863  0.241255         17  19.190588  43.11

In [78]:
# you can apply different function to different columns too
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [79]:
# Returning Agg data without row indices
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size  tips_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [80]:
# APPLY

In [81]:
tips

     total_bill   tip smoker   day    time  size  tips_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]